# Tonsf Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Tonsf Property
SymbolTypeId Class See Also
---
Symbol Tonsf, indicating unit US tonnes force.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Tonsf { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Tonsf As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Tonsf {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace